[
  {
    "name": "HTML",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/HTML.png",
    "description": "Hypertext Markup Language is the standard markup language for creating web pages and web applications. With Cascading Style Sheets and JavaScript, it forms a triad of cornerstone technologies for the World Wide Web.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/HTML",
    "pointDescription": [
      "Understanding basic HTML terms, tags, structure of a website and interlinkage of basic web technologies (Cascading Style Sheets and JavaScript).",
      "Understanding of basic HTML elements and the basic flow of creating HTML documents.",
      "An understanding of how opening tags and closing tags work, how to create an HTML document with the proper DOCTYPE, how to nest HTML tags within another, how to use attributes, and use them to inline style or add required data. How to use <style> and <script> to put CSS and JavaScript onto a HTML document",
      "Knowing most of HTML tags in the language, understand when to use tags. The client-server relationship in the abstract, how to use attributes to style and identification for tags, how to link external resources like CSS, and JavaScript into your HTML.  An understanding of the Document Object Model or DOM works and how your HTML will be read by accessible hardware such as screen readers",
      "Knowing all the HTML tags, the ability to manipulate the DOM, understanding how to create your own attributes using data-*, Build HTML documents semantically, How your HTML will be read by blogs, social networks, etc. for content"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [
      {
        "name": "CSS",
        "minPoint": 1,
        "recommended": true
      },
      {
        "name": "JavaScript",
        "minPoint": 1,
        "recommended": true
      }
    ],
    "trainings": [
      {
        "name": "HTML Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "The goal of this training is to introduce the terms and basic concepts of creating a website with HTML.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "CSS",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/CSS.png",
    "description": "Cascading Style Sheets is a style sheet language used for describing the presentation of a document written in a markup language like HTML. CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/CSS",
    "pointDescription": [
      "Understand that the purpose of CSS is keeping design and content separate, to the highest extent that is possible. Have made extensive modifications to a CSS template. Have used a WYSIWYG editor to create CSS web page. Have a basic understanding of CSS layout techniques.",
      "I have designed a reasonably complex website from scratch using only CSS for layout.I have a solid understanding of the structure of CSS, the CSS box model, and CSS positioning.I understand how to use float and deal with it's quirks.I have a basic understanding that different browsers render some CSS differently and that needs to be accounted for and tested.I have a growing collection of CSS resources to draw from.I do not use tables for layout whatsoever anymore. I understand that tables are for tabular data, not page layout.",
      "I have designed and coded a large number of CSS web sites.  I can convert a design from any format into a CSS layout: Photoshop, Illustrator, napkin drawings, etc.I am completely comfortable writing and editing CSS by hand.I have a strong understanding of the cascading part of CSS. Particularly how some some CSS properties do, some don't, and some depend on how the value is declared.I have a solid understanding of cross-browser CSS. I know how to use browser specific CSS statements and delclare browser specific stylesheets.I know and have tried some CSS hacks and understand the advantages and disadvantages of using them.I have a strong understanding of the different sizing values available in CSS (e.g. em, px, %, pt, small, etc.) and in what situations each make the most sense.I can quickly troubleshoot and solve CSS problems.I have a great collection of tools and resources at my disposal for inspiration, debugging, or reference.",
      "I feel like I could tackle any design idea with CSS.I can do pixel-perfect cross-browser conversions of designs into CSS websites.I can visualize markup structure easily, just by looking at a design.I have utilized additional web technologies to expand the possibilities and break through the limitations of CSS.I have my own CSS framework I use, complete with my own customized CSS reset.I have a strong understanding of advanced CSS like pseudo classes, pseudo elements, and attribute selectors.I keep up to date on browser support and development progress.",
      "I am involved with the future of CSS specifications or support.I am a CSS Celebrity.I've written books, given seminars, taught classes, knew CSS since she was a little girl, etc.I don't need to do testing, I just know."
    ],
    "maxPoint": 5,
    "parents": [
      "HTML"
    ],
    "children": [
      {
        "name": "CSS tools",
        "minPoint": 2,
        "recommended": false
      },
      {
        "name": "Photoshop",
        "minPoint": 0,
        "recommended": false
      }
    ],
    "trainings": [
      {
        "name": "CSS Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "CSS tools",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/CSS_tools.png",
    "description": "CSS tools and frameworks are meant to allow for easier, more standards-compliant web design using the Cascading Style Sheets language.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/CSS_framework",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "CSS"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Top10 CSS Tools",
        "level": 1,
        "shortDescription": "10 Best CSS Tools & Web-Based Apps For Developers",
        "URL": "https://1stwebdesigner.com/best-css-tools/",
        "URLlastAccessed": "2018-11-19",
        "goal": "Describing the top 10 CSS libraries, tools, webapps and automated scripts that make it so much easier to build websites.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Photoshop",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Photoshop.png",
    "description": "...",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Photoshop",
    "pointDescription": [
      "You understand what you see. Navigate through the menu items. Can use basic tools: rubber, brush, select tool",
      "Understands layer management. You know what the tools are. What effect do you have on their use.",
      "I use the colors, layers and basic tools confidently. I understand 3d design and vectors.",
      "Knows the shortcuts. Understand the most of things. You made brochure, flyer, website.",
      "Manages the functions on a professional level. Understands customer needsm ideas and make them better. "
    ],
    "maxPoint": 5,
    "parents": [
      "CSS"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Photoshop Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "JavaScript",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/JavaScript.png",
    "description": "JavaScript, often abbreviated as JS, is a high-level, interpreted programming language that conforms to the ECMAScript specification. It is a language which is also characterized as dynamic, weakly typed, prototype-based and multi-paradigm.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Javascript",
    "pointDescription": [
      "Basic knowledge CSS and HTML. Saw a code once.",
      "Intermediate knowledge of both HTML and CSS. Variables and how to declare them. Know operators, like +, -, etc.",
      "Know the functions. What an API is. How to access and query the DOM.Understand loops. Create and render new elements on to the DOM.How and when JS renders on a web page. Know the events. How to listen for events and create your own.",
      "Function and variable scopes, you should know what this is. Anonymous functions and Immediately Invoked Function Expression (IIFE). Browser support for new JS features and how to use polyfills to fill in support when needed",
      "How to make an AJAX request. How to use promises and know when you get data. The differences in var, let, and const to declare variables. What closures are and how to utilize them. What Object-Oriented Programming, or OOP, is and how it can happen in Javascript. Optimization of logic for speed."
    ],
    "maxPoint": 5,
    "parents": [
      "HTML"
    ],
    "children": [
      {
        "name": "NodeJS",
        "minPoint": 1,
        "recommended": false
      },
      {
        "name": "React",
        "minPoint": 1,
        "recommended": false
      }
    ],
    "trainings": [
      {
        "name": "HTML Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Java",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Java.png",
    "description": "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Java",
    "pointDescription": [
      "Maybe you now what is Java Developer's Kit",
      "Need to know object oriented programming concepts. Know some sort of source control like Git. Know how to complete basic coding tasks like the Fibonacci. ",
      "Start to unnderstanding how every piece of code fits together in the big picture. This takes theoretical thinking.",
      "Knowledge of the intricacies of SQL queries is another thing that great Java developers tend to have. Basic CRUD operations and things like joins, aggregations, and indexing are all big parts of it.",
      "Java developer is skilled in the use of the technologies in the Java ecosystem: Struts, Spring, Maven, Gradle, Ant, JUnit, Spock, and Hibernate, among many others."
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [
      {
        "name": "JavaFX",
        "minPoint": 1,
        "recommended": false
      }
    ],
    "trainings": [
      {
        "name": "Java Basics",
        "level": 1,
        "shortDescription": "Learn Java 8 - Full Tutorial for Beginners",
        "URL": "https://www.youtube.com/watch?v=grEKMHGYyns",
        "URLlastAccessed": "2018-11-19",
        "goal": "Learn Java 8 and object oriented programming with this complete Java course for beginners.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "JavaFX",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/JavaFX.png",
    "description": "JavaFX is a software platform for creating and delivering desktop applications, as well as rich Internet applications (RIAs) that can run across a wide variety of devices. ",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/JavaFX",
    "pointDescription": [
      "First have to know is some basic about core Java like loops, method, interface, variables and Event handling.",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Java"
    ],
    "children": [],
    "trainings": [
      {
        "name": "HTML Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "NodeJS",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/NodeJS.png",
    "description": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser. ",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Node.js",
    "pointDescription": [
      "Solid knowledge about JavaScript, HTML CSS.",
      "Understans API communication and OOPs concepts",
      "Good knowledge of HTML, CSS, JQuery, MySQL, SQL Server, Git, JQuery UI, AJAX, JSO. Have a knowledge on NodeJS framework: Express.js, Koa.js, Hapi, and Total.js",
      "Have experience in implementing Data Protection. Can able to develop Single Page Application with MVC architecture",
      "Great knowledge of User Authentication and Authorization. Knowledge of integrating multiple data sources and databases into one system."
    ],
    "maxPoint": 5,
    "parents": [
      "JavaScript"
    ],
    "children": [],
    "trainings": [
      {
        "name": "NodeJS Basics",
        "level": 1,
        "shortDescription": "Learn Node.js - Full Tutorial for Beginners",
        "URL": "https://www.youtube.com/watch?v=RLtyhwFtXQA",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Go",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Go.png",
    "description": "Go (often referred to as Golang) is a fully open-source programming language. It is statically typed, compiled, and syntactically similar to C, with the added benefits of memory safety, garbage collection, structural typing, and CSP-style concurrency.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Go_(programming_language)",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "HTML Basics",
        "level": 1,
        "shortDescription": "HTML Crash Course For Absolute Beginners",
        "URL": "https://www.youtube.com/watch?v=UB1O30fR-EE",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Python",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Python.png",
    "description": "Python is an interpreted, high-level, general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python has a design philosophy that emphasizes code readability, notably using significant whitespace.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Python_(programming_language)",
    "pointDescription": [
      "Start understanding nested loops and how logic works in nested loops.",
      "Basic knowledge of how statements work and conceptually how they work",
      "Some basic JavaSript knowledge. Understanding of server-side templating languages such as Jinja 2, Mako.",
      "Knowledge of at least one Python web frameworksuch as Django, Flask. Familiarity with some ORM (Object Relational Mapper) libraries. Able to integrate multiple data sources and databases into one system.",
      "Can to complete all parts of the work, including documentation and testing. Able to create database schemas that represent and support business processes. Strong unit test and debugging skills."
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [
      {
        "name": "NumPy",
        "minPoint": 3,
        "recommended": false
      }
    ],
    "trainings": [
      {
        "name": "Python Basics #1 of 8 - Integers, Floats and Maths",
        "level": 1,
        "shortDescription": "If you're a beginner and/or mildly interested in learning Python scripting/programming, this is a place to start!",
        "URL": "https://www.youtube.com/watch?v=D48iCw3WWpI",
        "URLlastAccessed": "2018-11-19",
        "goal": "Will walking you through a bit of programming theory, some of the basics for variable creation and math functions used in Python.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "NumPy",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Python.png",
    "description": "NumPy is the fundamental package for scientific computing with Python.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/NumPy",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 3,
    "parents": [
      "Python"
    ],
    "children": [],
    "trainings": [
      {
        "name": "NumPy Tutorial",
        "level": 2,
        "shortDescription": "Before reading this tutorial you should know a bit of Python. If you would like to refresh your memory, take a look at the Python tutorial.",
        "URL": "https://www.numpy.org/",
        "URLlastAccessed": "2018-11-19",
        "goal": "Quickstart with NumPy from basics to Shape Manipulation, Copies and Views, Indexing and other tips and tricks.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Scrum",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Scrum.png",
    "description": "Scrum is an agile framework for managing knowledge work, with an emphasis on software development. It is designed for teams of three to nine members, who break their work into actions that can be completed within timeboxed iterations, called 'sprints', no longer than one month and most commonly two weeks, then track progress and re-plan in 15-minute stand-up meetings, called daily scrums.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Scrum",
    "pointDescription": [
      "You have to be able to organize an appointment. This means that you must perform administrative tasks. For example, creating tables and uploading data. This is an important step to complete your sprint.",
      "Soft skills are important: decision making, ability to facilitate. Respect: team members accept what you say.",
      "It is increasingly handling the problems better and better. Effectively relieves the team. Take care to the quality of code and documentation. Moderate during team meetings.",
      "Continuously improve processes . Maintain a proper balance between project owner, scrum team, and management. Start work together the project owner.",
      "Knowing the most of things what the project owner. Undertans the big picture. Dealing with difficult situations. Walk project owner through user stories."
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [
      {
        "name": "Scaled Agile Framework",
        "minPoint": 2,
        "recommended": false
      }
    ],
    "trainings": [
      {
        "name": "Scrum Basics",
        "level": 1,
        "shortDescription": "Scrum Crash Course",
        "URL": "https://www.youtube.com/watch?v=2Vt7Ik8Ublw",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      },
      {
        "name": " The Scrum Guide",
        "level": 1,
        "shortDescription": "Scrum is defined completely in the Scrum Guide by Ken Schwaber and Jeff Sutherland, the originators of Scrum.",
        "URL": "https://www.scrumguides.org/",
        "URLlastAccessed": "2018-11-19",
        "goal": "This Guide contains the definition of Scrum. This definition consists of Scrum’s roles, events, artifacts, and the rules that bind them together.",
        "length": 0,
        "language": "many"
      }
    ]
  },
  {
    "name": "Coaching",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Coaching.png",
    "description": "ICF defines coaching as partnering with clients in a thought-provoking and creative process that inspires them to maximize their personal and professional potential, which is particularly important in today's uncertain and complex environment.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Coaching",
    "pointDescription": [
      "Understanding concepts, values and beliefs; the use of facilitative behaviours such as active listening, paraphrasing, questioning, summarising, managing time; encouraging participation; keeping clear and accurate notes; using basic tools like problem solving and action planning.",
      "Mastering process tools; designing meetings; skilled at using the right decision making method, achieving consensus, and getting true closure; handling feedback activities and conducting process checks; using exit surveys; good at managing meetings in an effective manner; able to help a group set goals and objectives that are measurable; skilled at checking assumptions and challenging ideas.",
      "Skilled at managing conflict and making immediate interventions; able to deal with resistance and personal attacks; making design changes on the spot; sizing up a group and using the right strategies for its development stage; managing survey feedback exercises; able to design and conduct interviews and focus groups, design and implement surveys; consolidating ideas from a mass of information into coherent summaries.",
      "Design and implement process interventions in response to complex organisational issues; use tools to promote process improvement, customer intimacy, and overall organisational effectiveness; able to support teams in the various stages of team development.",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction to Coaching",
        "level": 1,
        "shortDescription": "Introducing the basic aspects of coaching.",
        "URL": "https://www.youtube.com/watch?v=vKwIi34C9zk",
        "URLlastAccessed": "",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Machine Learning",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/MachineLearning.png",
    "description": "Machine learning (ML) is a field of artificial intelligence that uses statistical techniques to give computer systems the ability to 'learn' (e.g., progressively improve performance on a specific task) from data, without being explicitly programmed.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Machine_learning",
    "pointDescription": [
      "Understanding the entire ecosystem that you’re designing for. You know how to program like Python.",
      "Understanding statistics, especially Bayesian probability, is essential for many machine learning algorithms",
      "Machine learning is an exceptionally wide and interdisciplinary field that consolidates linear algebra, statistics, hacking skills, database skills, and distributed computing skills.",
      "Knows distributed systems for large data: MPI, Grid Engine. ",
      "Ununderstand how the different pieces work together, communicate with them (using library calls, REST APIs, database queries, etc.) and build appropriate interfaces."
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "ML Basics",
        "level": 1,
        "shortDescription": "A Friendly Introduction to Machine Learning",
        "URL": "https://www.youtube.com/watch?v=IpGxLWOIZy4",
        "URLlastAccessed": "2018-11-19",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "UI/UX Design",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/UI_UX_Design.png",
    "description": "User experience design (UX, UXD, UED or XD) is the process of enhancing user satisfaction with a product by improving the usability, accessibility, and pleasure provided in the interaction with the product. User experience design encompasses traditional human–computer interaction (HCI) design, and extends it by addressing all aspects of a product or service as perceived by users.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/User_experience_design",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "UX Design Tutorial for Beginners (#1)",
        "level": 1,
        "shortDescription": "UX design tutorial for beginners. Easy to understand UX design tutorial, no jargon.",
        "URL": "https://youtu.be/I0-vBdh4sZ8",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "React",
    "categoryName": "Maths,science and engineering",
    "skillIcon": "pictures/icons/React.png",
    "description": "In computing, React (also known as React.js or ReactJS) is a JavaScript library for building user interfaces. It is maintained by Facebook and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications. Complex React applications usually require the use of additional libraries for state management, routing, and interaction with an API.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/React_(JavaScript_library)",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "JavaScript"
    ],
    "children": [],
    "trainings": [
      {
        "name": "React JS Crash Course",
        "level": 1,
        "shortDescription": "In this video we will cover the fundamentals for React.js.",
        "URL": "https://youtu.be/A71aqufiNtQ",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Search Engine Optimization",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/SEO.png",
    "description": "Search engine optimization (SEO) is the process of affecting the online visibility of a website or a web page in a web search engine's unpaid results—often referred to as 'natural', 'organic', or 'earned' results. In general, the earlier (or higher ranked on the search results page), and more frequently a website appears in the search results list, the more visitors it will receive from the search engine's users; these visitors can then be converted into customers. SEO may target different kinds of search, including image search, video search, academic search, news search, and industry-specific vertical search engines. SEO differs from local search engine optimization in that the latter is focused on optimizing a business' online presence so that its web pages will be displayed by search engines when a user enters a local search for its products or services. The former instead is more focused on national or international searches.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Search_engine_optimization",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "SEO For Beginners - How to Rank High In Google?",
        "level": 1,
        "shortDescription": "Search Engine Optimization (SEO) step-by-step tutorial for beginners.",
        "URL": "https://youtu.be/y_AAO7QfsiI",
        "URLlastAccessed": "2018-12-11",
        "goal": "In this video, you will learn all the necessary SEO techniques to rank your websites high in Google search engine.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Project Coordination",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Project_Coordination.png",
    "description": "Administration that oversees the day-to-day operations of a particular project within an organization. ",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Beginner's Guide to Project Coordination",
        "level": 1,
        "shortDescription": "We will talk about how to run, staff, and organize a project. Topics include creating a project proposal, timeline, budget, how to implement your project plan, and strategies for overcoming challenges that may arise.",
        "URL": "https://youtu.be/B9FG3VyTJGI",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Stakeholder Engagement",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Stakeholder_Engagement.png",
    "description": "Stakeholder engagement is the process by which an organization involves people who may be affected by the decisions it makes or can influence the implementation of its decisions. They may support or oppose the decisions, be influential in the organization or within the community in which it operates, hold relevant official positions or be affected in the long term.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Stakeholder_engagement",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction to Stakeholder Engagement",
        "level": 1,
        "shortDescription": "Learn about involving stakeholders in SLDS work through “Stakeholder Land,” a fictional board game about navigating the process of stakeholder engagement.",
        "URL": "https://youtu.be/l3_Hhe24W3g",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Microsoft Excel",
    "categoryName": "Digital competence",
    "skillIcon": "pictures/icons/Microsoft_Excel.png",
    "description": "Microsoft Excel is a spreadsheet developed by Microsoft for Windows, macOS, Android and iOS. It features calculation, graphing tools, pivot tables, and a macro programming language called Visual Basic for Applications.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Microsoft_Excel",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "The Beginner's Guide to Excel - Excel Basics Tutorial",
        "level": 1,
        "shortDescription": "Learn the basics of using Microsoft Excel, including the anatomy of a spreadsheet, how to enter data, how to make your data look good so it's easier to read and use, and more. This tutorial was made using Excel 2016, but is applicable to older versions of Excel and newer versions too.",
        "URL": "https://youtu.be/rwbho0CgEAE",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Microsoft Outlook",
    "categoryName": "Digital competence",
    "skillIcon": "pictures/icons/Microsoft_Outlook.png",
    "description": "Microsoft Outlook is a personal information manager from Microsoft, available as a part of the Microsoft Office suite. Although often used mainly as an email application, it also includes a calendar, task manager, contact manager, note taking, journal, and web browsing.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Microsoft_Outlook",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Microsoft Outlook 2016 Tutorial | Basics ,Tricks And Tips",
        "level": 1,
        "shortDescription": "We show you best practices for managing your email and calendar efficiently, including switching views in calendar and email, scheduling meetings and conference rooms, and categorizing your appointments with colors. Learn how to assign permissions to a delegate and share your calendar with others.",
        "URL": "https://youtu.be/ZeXHWdgtH6k",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Microsoft Word",
    "categoryName": "Digital competence",
    "skillIcon": "pictures/icons/Microsoft_Word.png",
    "description": "Microsoft Word (or simply Word) is a word processor developed by Microsoft.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Microsoft_Word",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Beginner's Guide to Microsoft Word",
        "level": 1,
        "shortDescription": "Learn the basics of effectively using Microsoft Word, including how to format images so that they can be moved freely around your document and positioned where you want them to be.",
        "URL": "https://youtu.be/S-nHYzK-BVg",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Commercial Awareness",
    "categoryName": "Entrepreneurship (Business)",
    "skillIcon": "pictures/icons/Commercial_Awareness.png",
    "description": "Knowledge of how businesses make money, what customers want, and what problems there are in particular areas of business:",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "What is Commercial Awareness?",
        "level": 1,
        "shortDescription": "Bright Network's resident commercial awareness guru, Ben explains what it is, why it's an important skill to demonstrate when applying for graduate opportunities and how you can build up up your commercial awareness.",
        "URL": "https://youtu.be/cPefkxTvG04",
        "URLlastAccessed": "2018-12-11",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Robot Framework",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Robot_Framework.png",
    "description": "The Robot Framework is a generic test automation framework for acceptance testing and acceptance test-driven development (ATDD). It is a keyword-driven testing framework that uses tabular test data syntax.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Robot_Framework",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Robot Framework Beginner Tutorial 1",
        "level": 1,
        "shortDescription": "Getting started with Robot Framework Step by Step",
        "URL": "https://youtu.be/8h5knh2jLCA",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Scaled Agile Framework",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/SAFe.png",
    "description": "SAFe promotes alignment, collaboration, and delivery across large numbers of agile teams. It was developed by and for practitioners, by leveraging three primary bodies of knowledge: agile software development, lean product development, and systems thinking.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Scaled_agile_framework",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Scrum"
    ],
    "children": [],
    "trainings": [
      {
        "name": "SAFe in 7 minutes",
        "level": 1,
        "shortDescription": "An overview to the Scaled Agile Framework - SAFe in 7 minutes.",
        "URL": "https://youtu.be/RXzurBazN-I",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      },
      {
        "name": "SAFe homepage",
        "level": 1,
        "shortDescription": "An overview to the Scaled Agile Framework - SAFe in 7 minutes.",
        "URL": "http://scaledagileframework.com/",
        "URLlastAccessed": "2019-01-23",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Test-driven development",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/TDD.png",
    "description": "Test-driven development (TDD) is a software development process that relies on the repetition of a very short development cycle: requirements are turned into very specific test cases, then the software is improved to pass the new tests, only. This is opposed to software development that allows software to be added that is not proven to meet requirements.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Test-driven_development",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Agile in Practice: Test Driven Development",
        "level": 1,
        "shortDescription": "Agile in Practice: Test Driven Development",
        "URL": "https://youtu.be/uGaNkTahrIw",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Conflict resolution",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Conflict_Resolution.png",
    "description": "Conflict resolution is conceptualized as the methods and processes involved in facilitating the peaceful ending of conflict and retribution. Committed group members attempt to resolve group conflicts by actively communicating information about their conflicting motives or ideologies to the rest of the group (e.g., intentions; reasons for holding certain beliefs) and by engaging in collective negotiation.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Conflict_resolution",
    "pointDescription": [
      "Identify the source of the conflict. The more information you have about the cause of the conflict, the more easily you can help to resolve it. To get the information you need, use a series of questions to identify the cause, like, “When did you feel upset?” “Do you see a relationship between that and this incident?” “How did this incident begin?” ",
      " Active listeningSeveral strategies help with distinguishing who has a problem with a behavior and who takes ownership. One of those strategies is active listening. Active listening is attending carefully to all aspects of what a student says and attempting to understand or empathize as much as one can (Seifert & Sutton). Active listening consists of continually asking questions in order to test your understanding. It also requires giving encouragement to the student by letting them tell their story, and paraphrasing what the student says so you can form an unbiased conclusion. It is key not to move too quickly at solving the problem by just giving advice, instructions, or scolding. Responding too soon with solutions can shut down the student’s communication and leave you with inaccurate impressions of the source or nature of the problem (Seifert & Sutton)",
      " After getting each party’s viewpoint on the conflict, the next step is to get each to identify how the situation could be changed. Again, question the parties to solicit their ideas: “How can you make things better between you?” ",
      " Identify solutions both disputants can support. You are listening for the most acceptable course of action. Point out the merits of various ideas, not only from each other’s perspective, but in terms of the benefits to the organization.",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Conflict – Use It, Don’t Defuse It",
        "level": 1,
        "shortDescription": "The #1 source of pain on a team, or in any relationship, is conflict. What if conflict wasn’t good or bad? What if conflict was an energy source your team could harness to produce innovative, creative, and transformational results? Invest 18 minutes learning the two magic ingredients and how you can put them to work with any team you care about.",
        "URL": "https://youtu.be/o97fVGTjE4w",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Negotiation",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Negotiation.png",
    "description": "Conflict resolution is conceptualized as the methods and processes involved in facilitating the peaceful ending of conflict and retribution. Committed group members attempt to resolve group conflicts by actively communicating information about their conflicting motives or ideologies to the rest of the group (e.g., intentions; reasons for holding certain beliefs) and by engaging in collective negotiation.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Negotiation",
    "pointDescription": [
      "At the basic level, the negotiator has learned and developed an organized or systematic framework for preparing for and conducting negotiations.  Generally, basic level negotiators have limited experience and skill in applying a limited set of tools.  ",
      "At the intermediate level, the negotiator has mastered basic negotiating tools and has begun adding additional tools to his or her negotiation tool kit.  More importantly, the negotiator uses the tools to prepare for, conduct and review each negotiation.  The negotiator explicitly uses the tools across a range of experiences so that he or she develops a great deal of experience and confidence in applying these tools. ",
      "The advanced negotiation skill level is reached when the negotiator has not only accumulated a wide range of negotiation tools, frameworks and processes, through study, practice and experience but has also developed awareness of his or her own negotiation strengths and weaknesses and consciously uses that knowledge to manage him or herself so that negotiation strengths are maximized and negotiation weaknesses don’t impede the negotiations.  A negotiator who has reached the advanced stage also has strong skills in negotiation process design(designing how the parties will negotiate, not just that about which they will negotiate) and has developed the discretion as to when to use which tools and processes and can execute the selected tools with skill.   ",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "The Art of Negotiation | Maria Ploumaki",
        "level": 1,
        "shortDescription": "Maria describes the most important skills behind successful negotiation, and she explains how to develop and master such qualities.",
        "URL": "https://youtu.be/pjlPgJ1wBdM",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "HR Policies",
    "categoryName": "Entrepreneurship (Business)",
    "skillIcon": "pictures/icons/HR_Policies.png",
    "description": "Series of policies country-, business- and company-dependant which shape contractual relationships.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "HR Policies and Procedures",
        "level": 1,
        "shortDescription": "PHR SPHR Human Resources Study Guide",
        "URL": "https://youtu.be/XKYGO3oN_ck",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Spring framework",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Spring_Framework.png",
    "description": "The Spring Framework is an application framework and inversion of control container for the Java platform. The framework's core features can be used by any Java application, but there are extensions for building web applications on top of the Java EE (Enterprise Edition) platform. Although the framework does not impose any specific programming model, it has become popular in the Java community as an addition to, or even replacement for the Enterprise JavaBeans (EJB) model. The Spring Framework is open source.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Spring_Framework",
    "pointDescription": [
      "Understand the fundamentals of the Java Spring framework. Understand What the Spring framework is for",
      "Develop Java Applications, the Spring way.",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Spring Tutorial For Beginners With Examples",
        "level": 1,
        "shortDescription": "This Edureka Spring Framework Tutorial will help you in understanding the fundamentals of Spring Framework and help you in building a strong foundation in Spring with examples.",
        "URL": "https://youtu.be/rMLP-NEPgnM",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Git",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Git.png",
    "description": "Git is a version-control system for tracking changes in computer files and coordinating work on those files among multiple people. It is primarily used for source-code management in software development, but it can be used to keep track of changes in any set of files. As a distributed revision-control system, it is aimed at speed, data integrity, and support for distributed, non-linear workflows.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Git",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Learn Git in 20 Minutes",
        "level": 1,
        "shortDescription": "In this video you learn how to initialize repositories, track files, stage changes, branch and merge, handle merge conflicts, stash changes, pull from and commit to remote repositories like GitHub.",
        "URL": "https://youtu.be/Y9XZQO1n_7c",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      },
      {
        "name": "Handling git commits",
        "level": 2,
        "shortDescription": "On undoing, fixing, or removing commits in git",
        "URL": "http://sethrobertson.github.io/GitFixUm/fixup.html",
        "URLlastAccessed": "2019-01-03",
        "goal": "This document is an attempt to be a fairly comprehensive guide to recovering from what you did not mean to do when using git.",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Docker",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Docker.png",
    "description": "Docker is a computer program that performs operating-system-level virtualization, also known as 'containerization'.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Docker_(software)",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Docker Tutorial - What is Docker & Docker Containers, Images, etc?",
        "level": 1,
        "shortDescription": "In these tutorials, I'll be breaking down exactly what a Docker container is and how to use it.",
        "URL": "https://youtu.be/pGYAg7TMmp0",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      },
      {
        "name": "Docker Tutorial - What is Docker & Docker Containers, Images, etc?",
        "level": 1,
        "shortDescription": "In these tutorials, I'll be breaking down exactly what a Docker container is and how to use it.",
        "URL": "http://training.docker.com/category/self-paced-online",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Redis",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Redis.png",
    "description": "Redis is an open-source in-memory data structure project implementing a distributed, in-memory key-value database with optional durability. Redis supports different kinds of abstract data structures, such as strings, lists, maps, sets, sorted sets, hyperloglogs, bitmaps, streams and spatial indexes.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Redis",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Redis Crash Course Tutorial",
        "level": 1,
        "shortDescription": "In this crash course we will discuss and demonstrate the fundamentals of Redis.",
        "URL": "https://youtu.be/Hbt56gFj998",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Jira",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/Jira.png",
    "description": "Jira is a proprietary issue tracking product developed by Atlassian which allows bug tracking and agile project management.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Jira_(software)",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "JIRA in a Nutshell demo video",
        "level": 1,
        "shortDescription": "An overview of JIRA: issue and project tracking for software teams.",
        "URL": "https://youtu.be/xrCJv0fTyR8",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "PostgreSQL",
    "categoryName": "Maths, science and engineering",
    "skillIcon": "pictures/icons/PostgreSQL.png",
    "description": "PostgreSQL, often simply Postgres, is an object-relational database management system (ORDBMS) with an emphasis on extensibility and standards compliance. It can handle workloads ranging from small single-machine applications to large Internet-facing applications (or for data warehousing) with many concurrent users; on macOS Server, PostgreSQL is the default database; and it is also available for Microsoft Windows and Linux (supplied in most distributions).",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/PostgreSQL",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Facilitation",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/Facilitation.png",
    "description": "A process where an individual who is agreed upon and acceptable to all of a group's members intervenes to assist the group in solving problems and making decisions to improve productivity and efficiency but who has no authority to make decisions.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Facilitation_(business)",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Building Trust",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "http://plumseattle.com/wp-content/uploads/2013/11/badge-hr-consulting.png",
    "description": "Trust is one of the keyfactors to be considered. Trust forms the basis of all relationships and interactions. It is just as important in professional relationships as it is in personal ones. Without each party trusting one another the ability to come to an agreement or consensus on an issue is always going to be compromised. Some benefits of trust: Increased productivity amonst staff Improved morale amongst employees and staff The ability to work more effectively as a team, rather than individuals Reduce the time to make and discuss key issues as each individual trusts in the judgement and expertise of their colleagues.",
    "descriptionWikipediaURL": "https://www.forbes.com/sites/forbescoachescouncil/2018/01/04/five-simple-tips-for-building-trust-as-a-leader/#6e209e3459bb",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Professional Networking",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Creating external partnerships (not only internal) that benefit the company. Human resources is often seen as an ‘internal’ part of business but doesn’t mean outside world is not important. Strike up new relationships that benefit to the workforce and to the company’s goals. It’s a great way of gaining external credibility.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Business_networking",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Identifying External Influences",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "How you identify and handle external threats and opportunities that might affect the companie’s human capital. Examples of external threats and opportunities that an HR business partner should know to look out for might include:– Changes to employment legislation – New job openings from close competitors – Mass redundancies within your industry",
    "descriptionWikipediaURL": "https://sites.google.com/a/my.shu.ac.uk/hr-group-8/external-influences",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Managing Talent",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "A keen eye for the kind of talent a company really needs; the ability to find and attract that talent; and a great talent retention strategy to ensure business continuity.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Talent_management",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Creating Company Culture",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Creating a strong organisational culture is vital for an HR Consultant. The company culture will narrate the direction of your organisation, as it will heavily influence how the people behave and perform. Aspects of creating a great company culture include:– Understanding and meeting the needs of employees – Implementing professional development plans that increase skillsets while helping your people feel valued – Helping to the people to really feel connected with your company’s values and goals",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Organizational_culture",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Effective Listening",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Listening is an essential part of spoken communication. Speaking and listening go together and oral communication cannot be effective without proper listening. Poor listening defeats the very purpose of spoken words. Listening is a deliberate effort and is much more than hearing. It requires getting the full meaning of what is being said. Listening effectively takes skill, self-motivation, and practice. Effective listening means concentrating on what the speaker says rather than on how it is said. Lack of attention and respectful listening can be costly - leading to mistakes, poor service, misaligned goals, wasted time and lack of teamwork.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Active_listening",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Being Approachable & Accessible",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Keeping yourself actively involved in your company’s day-to-day affairs. Making yourself accessible and approachable to the people you’re representing will give you a level of company knowledge that cannot be found on monthly performance reports or attendance sheets.",
    "descriptionWikipediaURL": "https://www.lollydaskal.com/leadership/leadership-be-approachable/",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Change Management",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Manages change in a systematic approach both from an organizational and an individual level. Ability to create the structure to execute and sustain change through clear design, aligned roles  relationships and governance. Applies structured approaches to shift individuals, teams, and organizations from a current state to a desired state.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Change_management",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Persuasion",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Uses persuasion and negotiation to gain agreement and buy-in. Promotes idea, agenda or direction on behalf of self or others. Seeks support from communities to ensure that persuasion is effective. Stands up and speaks the mind up, escalates when  needed.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Persuasion",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Negotiating",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Can negotiate skillfully in tough situations with both internal and external groups; can settle differences with minimum noise; can win concessions without damaging relationships; can be both direct and forceful as well as diplomatic; gains trust quickly of other parties to the negotiations; has a good sense of timing. Understands that all interaction can be considered as negotiation, e.g. finding positions and motives. Prepares for the commercial and/or technical sales negotiations with the appropriate team involved. Makes negotiation strategy that enhances the long term relationship and executes it with confidence and persuasion following company policies. Influences on negotiation process and negotiators to gain the deal that does not compromise the pre set targets. Never agrees terms which are detrimental to profitability in the long run across the solution/product lifecycle.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Negotiation",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Problem-Solving",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Uses rigorous logic and methods to solve difficult problems with effective solutions; probes all fruitful sources for answers; can see hidden problems; looks beyond the obvious and doesn't stop at the first answers.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Problem_solving",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Training",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Knowledge and skills in training techniques for both the occasional (L1, L2) and professional trainer (L3, L4, L5). Use of instructional styles adequate to the target group and training objectives, apply presentation and communication skills using various delivery methods and tools. Based on the level, including learning technologies needed in a modern (virtual) learning environment.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Training",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  },
  {
    "name": "Consulting",
    "categoryName": "Soft skills (& civic competence)",
    "skillIcon": "pictures/icons/qwe.png",
    "description": "Using knowledge of the Nokia business model and processes, the external operating environment and domain expertise to improve human capital and business outcomes. Asking the  right developmental questions.",
    "descriptionWikipediaURL": "https://en.wikipedia.org/wiki/Consultant",
    "pointDescription": [
      "Insert Level 1 (Initial) Skill Description Here",
      "Insert Level 2 (Basic) Skill Description Here",
      "Insert Level 3 (Intermediate) Skill Description Here",
      "Insert Level 4 (Advanced) Skill Description Here",
      "Insert Level 5 (World Class) Skill Description Here"
    ],
    "maxPoint": 5,
    "parents": [
      "Soft Skills"
    ],
    "children": [],
    "trainings": [
      {
        "name": "Introduction To PostgreSQL",
        "level": 1,
        "shortDescription": "Introduce yourself to PostgreSQL , and learn about its features and usage.",
        "URL": "https://youtu.be/jNq5EAb2biY",
        "URLlastAccessed": "2018-12-15",
        "goal": "",
        "length": 0,
        "language": "en"
      }
    ]
  }
]
