[
  {
    "name": "Web Developer",
    "description": "A web developer is a programmer who specializes in, or is specifically engaged in, the development of World Wide Web applications, or applications that are run over HTTP from a web server to a web browser.",
    "focusArea": "Engineering",
    "skillNames": [
      "HTML",
      "Scrum",
      "CSS",
      "JavaScript",
      "CSS tools",
      "Photoshop",
      "NodeJS"
    ]
  },
  {
    "name": "Software Engineer",
    "description": "A software engineer is a person who applies the principles of software engineering to the design, development, maintenance, testing, and evaluation of computer software.",
    "focusArea": "Engineering",
    "skillNames": [
      "Go",
      "Java",
      "Python",
      "Test-driven development",
      "Scrum",
      "Scaled Agile Framework (SAFe)"
    ]
  },
  {
    "name": "Software Tester",
    "description": "Software testers provide various stakeholders information about the quality of the software product or service under test. Until the 1980s, the term 'Software tester' was used generally, but later it was also seen as a separate profession. Regarding the periods and the different goals in software testing, different roles have been established, such as test manager, test lead, test analyst, test designer, tester, automation developer, and test administrator.",
    "focusArea": "Engineering",
    "skillNames": [
      "Robot Framework",
      "Python",
      "Test-driven development"
    ]
  },
  {
    "name": "Data Scientist",
    "description": "Data science is an interdisciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from data in various forms, both structured and unstructured, similar to data mining. ",
    "focusArea": "Engineering",
    "skillNames": [
      "Java",
      "CSS",
      "Machine Learning"
    ]
  },
  {
    "name": "Scrum Master",
    "description": "Scrum is facilitated by a scrum master, who is accountable for removing impediments to the ability of the team to deliver the product goals and deliverables. The scrum master is not a traditional team lead or project manager but acts as a buffer between the team and any distracting influences. The scrum master ensures that the Scrum framework is followed. The scrum master helps to ensure the team follows the agreed processes in the Scrum framework, often facilitates key sessions, and encourages the team to improve. The role has also been referred to as a team facilitator or servant-leader to reinforce these dual perspectives.",
    "focusArea": "People",
    "skillNames": [
      "Scrum",
      "Conflict resolution",
      "Coaching",
      "Negotiation"
    ]
  },
  {
    "name": "Talent Acquisition Specialist",
    "description": "Fulfil an integral role in the organisation's growth and pursuit of its goals by providing the business with the best in-class support, coaching and outstanding programme management. By establishing and managing strong relationships with key hiring managers and stakeholders across Europe, they own, promote and contribute to clear and develop efective processes, hiring strategies, interview design and planning, candidate experience and offer negotiation. They also have a impact in the team's efficiency and strategy, strengthening our ability to hire quality, diverse talent.",
    "focusArea": "People",
    "skillNames": [
      "Project Coordination",
      "Stakeholder Engagement",
      "Microsoft Excel",
      "Microsoft Outlook",
      "Microsoft Word",
      "Commercial Awareness",
      "HR Policies"
    ]
  },
  {
    "name": "Frontend Developer",
    "description": "Individual whose responsability relies on the conversion of data to a graphical interface for the user to view and interact with through digital interaction using HTML, CSS and JavaScript.",
    "focusArea": "Engineering",
    "skillNames": [
      "HTML",
      "CSS",
      "Javascript",
      "UI/UX Design",
      "React",
      "Photoshop",
      "Search Engine Optimization"
    ]
  },
  {
    "name": "Backend Developer",
    "description": "Individual whose responsability relies on the conversion of data to a graphical interface for the user to view and interact with through digital interaction using HTML, CSS and JavaScript.",
    "focusArea": "Engineering",
    "skillNames": [
      "Java",
      "Spring",
      "Git",
      "Docker",
      "Redis",
      "Jira",
      "Scrum",
      "PostgreSQL"
    ]
  }
]
